#!/bin/bash

#位置变量

# 不加"" $*和$@是一样的,不会转义""
# 加了"" $*将所有的参数当成一行处理，$@不转移""(将""内字符当成一个参数)

# ./position_variable 1 "1 2 3" 4 ab c

echo '***************$****************'
for i in $*
do
    echo $i
done
echo '***************$****************'

echo '***************$****************'
for i in $@
do
    echo $i
done
echo '***************$****************'

echo "***************\""'$*'"\"***************"
for i in "$*"
do
    echo $i
done
echo "***************\""'$*'"\"***************"


echo "***************\""'$@'"\"***************"
for i in "$@"
do
    echo $i
done
echo "***************\""'$@'"\"***************"
